;; -*- no-byte-compile: t; -*-
;;; .doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:host github :repo "username/repo"))
;; (package! builtin-package :disable t)

;; gql
(package! graphql-mode )

;; js scheisse
(package! prettier-js)
(package! js-import)
(package! emmet-mode)
(package! move-text)
(package! eslint-fix)

;; typescript
(package! typescript-mode )

;; angular
(package! ng2-mode )
